Revit 2024 API
JoinGeometryUtils.AreElementsJoined Method
 Determines whether two elements are joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool AreElementsJoined(
	Document document,
	Element firstElement,
	Element secondElement
)
Visual Basic
Public Shared Function AreElementsJoined ( _
	document As Document, _
	firstElement As Element, _
	secondElement As Element _
) As Boolean
Visual C++
public:
static bool AreElementsJoined(
	Document^ document,
	Element^ firstElement,
	Element^ secondElement
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document containing the two elements.
firstElement
Type: Autodesk.Revit.DB.Element
 The first element.
secondElement
Type: Autodesk.Revit.DB.Element
 The second element.
Return Value
 True if the two elements are joined.
Remarks
 This functionality is not available for family documents.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- The element firstElement was not found in the given document. -or- The element secondElement was not found in the given document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
JoinGeometryUtils Class
Autodesk.Revit.DB Namespace